'''Вычисление элементарной функции с использованием
многочисленных приближений Чебышева. е^x и sin(x)'''
import math

#e^x
'''n = 7
eps = 0.000002 #точность
x = 0.5 #степень для е, |х| <= 1


a = [1, 0.5000063, 0.1666674, 0.0416350, 0.0083298, 0.0014393, 0.0002040]
c = 0.9999998
p = 1
k = 1
while k < n:
    p *= x
    u = p * a[k-1]
    print(f'u = {u}')
    c += u
    if abs(u) <= eps:
        break
    k += 1
print(f'c = {c}, k = {k}')'''

#sin(x)
x = math.pi/4
a = [1, 1.000000002, 1, -0.166666589, 1, 0.008333075, 1, -0.000198107, 1, 0.000002608]
eps = 0.000002
n = 9
k = 3
c = x
while k <= n:
    if k % 2 != 0:
        u = a[k] * (x**k)
        c += u
        if abs(u) <= eps:
            break
    k += 1

print(f'sin({round(x,6)}) = {round(c,6)}')